{
  "backend/main.mo": "Motoko actor defining data types and state for authorization, storage, glossary, articles, research papers, learning content, feedback, market data, and blogs.",
  "feature_evidence.json": "Feature evidence report mapping performance-related features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of concise summaries for key frontend files including routing, hooks, components, and pages.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation describing the staged deployment retry workflow with build, canister, and asset verification steps.",
  "frontend/index.css": "Tailwind base/theme definitions setting OKLCH color variables, dark mode overrides, and global styles.",
  "frontend/index.html": "HTML entry point defining fonts, favicons, base metadata, and mounting point for the React app.",
  "frontend/scripts/README.md": "Readme describing deployment helper scripts for building and deploying the application.",
  "frontend/scripts/retry-build-and-deploy-with-logs.sh": "Bash script automating build and deployment stages with detailed logging, error handling, and colored output.",
  "frontend/src/App.tsx": "Sets up the main React app with routing, theming, query client configuration, maintenance mode handling, and lazy-loaded pages.",
  "frontend/src/components/AsyncChatAssistantWidget.tsx": "Lazily loads the chat assistant widget after idle time or delay, rendering it only once loading is triggered.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo with error handling and a text fallback when the image fails to load.",
  "frontend/src/components/calculators/CashFlowSection.tsx": "Renders a cash flow table with optional running balance and CSV export, with an empty state when no rows exist.",
  "frontend/src/components/calculators/ResultBreakdownBarChart.tsx": "Empty placeholder file for a future bar chart component.",
  "frontend/src/components/calculators/ResultBreakdownPieChart.tsx": "Creates an SVG donut chart showing invested vs earned amounts with a fallback for missing data.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Implements an interactive chat UI with intent detection, backend calls, disclaimers, and message handling.",
  "frontend/src/components/domain/CustomDomainFaq.tsx": "Empty placeholder for a custom domain FAQ component.",
  "frontend/src/components/domain/CustomDomainGuide.tsx": "Empty placeholder for a custom domain setup guide component.",
  "frontend/src/components/Footer.tsx": "Renders the footer with a live or closing NIFTY 50 stock ticker and feedback/navigation utilities.",
  "frontend/src/components/GlossaryBackupRestorePanel.tsx": "Allows exporting, validating, and restoring glossary snapshots with merge or replace options.",
  "frontend/src/components/GlossaryBulkImportCTermsPanel.tsx": "Provides a UI to confirm and publish a predefined batch of C‑letter glossary terms.",
  "frontend/src/components/Header.tsx": "Navigation header with theme toggle, auth handling, and mobile menu, including calculator and admin links.",
  "frontend/src/components/MaintenanceScreen.tsx": "Displays a full-page maintenance message with branding and icon.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Simple centered loading spinner used as a route-level fallback.",
  "frontend/src/data/glossaryBulkImportC.ts": "Exports a batch of static glossary definitions for C‑terms used for bulk backend import.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing on identity changes and invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status states. Includes helper functions to create AuthClient with custom options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions, including maintenance checks, admin checks, user profiles, chat, glossary data, and other domain-specific queries. Integrates actor-based API calls with caching, error handling, and UI toasts.",
  "frontend/src/index.css": "Tailwind CSS setup with extensive theme tokens for light and dark modes, defining colors, radii, and component styling variables. Centralizes design system values for consistent theming across the app.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App. Loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and philosophy sections using styled cards and icons. Focuses on describing the platform's purpose and educational approach.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays categorized financial articles using tabbed navigation and React Query data fetching. Renders article previews with loading and empty states.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Provides an APY calculator that computes required monthly contributions based on user age and desired pension. Includes UI form inputs, validation, and formatted results.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post with metadata, tags, formatted dates, and handles loading and error states.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all blog posts with previews, categories, tags, and navigation to individual blog detail pages.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Provides a form-based CAGR calculator with inputs for values and years, showing computed growth results.",
  "frontend/src/pages/CalculatorsPage.tsx": "Shows categorized navigation cards for various financial calculators with icons and descriptions.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form submitting feedback via an API and displays email and Instagram contact options.",
  "frontend/src/pages/DisclaimerPage.tsx": "Displays legal disclaimers, investment risk warnings, and clarifies the educational nature of the platform.",
  "frontend/src/pages/DomainNamePage.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "A React page that calculates EMI, total interest, and repayment based on loan amount, interest rate, and tenure with formatted results.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "A calculator page that computes EPF contributions, interest accumulation, and maturity balance using salary and contribution inputs.",
  "frontend/src/pages/FDCalculatorPage.tsx": "A fixed-deposit calculator that supports simple and compound interest to compute maturity amount and interest earned.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "An admin page that authenticates users, checks admin rights, and displays searchable, sortable feedback with storage usage info.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "A calculator comparing fixed-rate and reducing-balance loan interest and repayment totals, showing the difference between methods.",
  "frontend/src/pages/GlossaryPage.tsx": "Implements searchable, grouped glossary with admin diagnostics, term parsing, and reference navigation.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Calculates gratuity based on last salary and years of service using the statutory formula and shows eligibility status.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "Provides a UI to input amount and GST rate, computes CGST/SGST split and total payable, and displays formatted results.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Calculates EMI, total interest, and total repayment for a home loan using principal, interest rate, and tenure inputs.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero banner, navigation buttons, and overview cards introducing the platform’s finance learning tools.",
  "frontend/src/pages/HRACalculatorPage.tsx": "Computes HRA exemption and taxable amount from salary, rent, and city type, displaying results with formatted values.",
  "frontend/src/pages/LearningPage.tsx": "Displays finance learning sections with topic matching, auto‑scrolling, and topic selection indicators using fetched content.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Provides a lump‑sum investment calculator using compound interest and displays results with charts and cash‑flow breakdown.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "Calculates NPS retirement corpus, annuity amount, and monthly pension based on user inputs.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "Computes NSC maturity value and interest earned using compound interest for fixed‑tenure investments.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "A PPF calculator page that computes maturity, invested amount, and interest based on yearly contributions, tenure, and rate, and displays results with a pie chart.",
  "frontend/src/pages/RDCalculatorPage.tsx": "An RD calculator page that calculates maturity value, total deposits, and interest for recurring deposits using monthly contributions and displays formatted results.",
  "frontend/src/pages/RegulationsPage.tsx": "A static informational page outlining SEBI and RBI guidelines, investor protection details, and fraud awareness using tabbed content and alerts.",
  "frontend/src/pages/ResearchPapersPage.tsx": "Fetches and displays research papers with loading states and allows users to download PDFs for each paper.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "Implements a simple interest calculator that computes interest and total amount based on principal, rate, and time.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "Calculates and compares simple and compound interest using principal, rate, time, and compounding frequency.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "A SIP calculator that computes future value, invested amount, and returns, and generates a cash flow schedule for monthly contributions.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "An SSY calculator that computes maturity value, deposit years, and returns based on yearly investment, girl’s age, and SSY rules.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "Offers step‑up SIP calculators using fixed-amount or percentage increases, computing total value, invested amount, and returns.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "Provides a SWP calculator with inputs for investment, withdrawal, return rate, and duration, computing month‑wise withdrawals and final balance.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "Builds an XIRR calculator allowing dynamic cash flow entries and estimating IRR via Newton‑Raphson.",
  "frontend/src/utils/arthSaathiChat.ts": "Provides language, intent, and calculator detection plus predefined refusal messages for the ArthSaathi chat assistant.",
  "frontend/src/utils/assetPaths.ts": "Generates base‑path‑aware asset URLs and centralizes static asset paths and brand metadata.",
  "frontend/src/utils/cashFlowSchedules.ts": "Utilities for generating cash‑flow labels, running balances, and contribution schedules for calculators.",
  "frontend/src/utils/csv.ts": "Implements CSV field escaping, array‑to‑CSV conversion, and client‑side CSV download.",
  "frontend/src/utils/feedbackForm.ts": "Stores the Google feedback form URL and provides helpers to open or embed it.",
  "frontend/src/utils/formatters.ts": "Contains number, currency, percentage, and byte‑size formatting utilities using Indian conventions.",
  "frontend/src/utils/glossaryFormatting.ts": "Parses glossary definitions, extracts references, normalizes term names, and groups terms for display.",
  "frontend/src/utils/glossaryKey.ts": "Normalizes glossary terms into deterministic keys for deduplication and backend compatibility.",
  "frontend/src/utils/learningTopics.ts": "Defines learning topic metadata and provides lookup and matching helpers by slug or section title.",
  "frontend/src/utils/navStructure.ts": "Defines the grouped navigation structure for the app including routes and subitems.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, extended color palette, container settings, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, existing optimization features, known issues, and pending feature requests related to performance improvements."
}