{
  "backend/main.mo": "Defines the backend actor with access control mixins, storage mixins, numerous data types, and in-memory maps for profiles, glossary, articles, research papers, learning sections, market data, and blogs.",
  "feature_evidence.json": "Contains feature evidence metadata mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Lists summarized descriptions of various frontend files including pages, components, hooks, and global styles.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation explaining the staged deployment retry process, common issues, and verification steps for frontend and backend builds.",
  "frontend/index.css": "Defines Tailwind base layers and extensive OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML template with font loading, favicon declarations, and root mount point for the frontend app.",
  "frontend/scripts/README.md": "Describes available deployment helper scripts, including a script for full build-and-deploy retries with logs.",
  "frontend/scripts/retry-build-and-deploy-with-logs.sh": "Bash script automating dependency installation, frontend build, canister build, and deployment with detailed logging and error handling.",
  "frontend/src/App.tsx": "Sets up routing, theming, query client, maintenance-mode handling, and the global layout including header, footer, and chat widget.",
  "frontend/src/components/BrandLogo.tsx": "Renders the brand logo with error handling and optional text fallback when the image fails to load.",
  "frontend/src/components/calculators/CashFlowSection.tsx": "Displays a cash‑flow table with optional running balance and supports exporting the data to CSV, with an empty-state fallback.",
  "frontend/src/components/calculators/ResultBreakdownBarChart.tsx": "No content provided.",
  "frontend/src/components/calculators/ResultBreakdownPieChart.tsx": "Renders an investment breakdown donut chart using SVG, handling empty states and showing invested vs earned proportions.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Implements an interactive chat widget with intent detection, backend queries, disclaimers, and UI controls for sending and displaying messages.",
  "frontend/src/components/domain/CustomDomainFaq.tsx": "No content provided.",
  "frontend/src/components/domain/CustomDomainGuide.tsx": "No content provided.",
  "frontend/src/components/Footer.tsx": "Displays a footer with an Indian market ticker, determining live or closing data and rendering NIFTY 50 stock prices.",
  "frontend/src/components/GlossaryBackupRestorePanel.tsx": "Provides UI and logic to export, validate, and restore glossary snapshots with merge or replace options and confirmation flows.",
  "frontend/src/components/Header.tsx": "Renders the top navigation bar with theme switching, authentication controls, navigation links, and calculator menus.",
  "frontend/src/components/MaintenanceScreen.tsx": "Shows a branded maintenance screen with messaging and styling when the app is in maintenance mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for handling Internet Identity login, persistence, and status management via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for maintenance checks, admin checks, user profiles, chat, and glossary data using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus extensive theme tokens for light and dark modes using OKLCH values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with sections for mission, vision, and educational philosophy using styled cards and icons.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays article categories in tabbed layout and lists fetched articles with loading and empty states.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Provides an APY calculator based on age and desired pension, using an internal contribution matrix and showing computed results.",
  "frontend/src/pages/BlogDetailPage.tsx": "Loads and displays a single blog post with metadata, tags, content, and error/loading handling.",
  "frontend/src/pages/BlogsPage.tsx": "Fetches and lists blog posts with metadata previews, tags, and navigation to individual blog detail pages.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Implements a CAGR calculator that computes growth rate from initial value, final value, and time period with user inputs.",
  "frontend/src/pages/CalculatorsPage.tsx": "Renders categorized lists of financial calculators with navigation links and icons.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact and feedback form with email links and submission via a feedback API.",
  "frontend/src/pages/DisclaimerPage.tsx": "Displays legal disclaimers about investment risks and clarifies the site's educational purpose.",
  "frontend/src/pages/DomainNamePage.tsx": "Empty placeholder page with no content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "Calculates and displays EMI, total interest, and total repayment based on loan inputs.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "Computes EPF contributions, interest, and maturity balance from salary and rate inputs.",
  "frontend/src/pages/FDCalculatorPage.tsx": "Provides a UI to calculate fixed deposit maturity amounts using simple or quarterly compound interest based on user inputs.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "Displays an admin-only feedback management panel with authentication, search, sorting, and table rendering of all feedback entries.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "Compares fixed-rate and reducing-balance loan interest by computing total repayment and interest for both methods.",
  "frontend/src/pages/GlossaryPage.tsx": "Implements a searchable financial glossary with grouped terms, admin backup/restore options, and reference linking between terms.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Provides a gratuity calculator using salary and years of service inputs with eligibility checks and formatted output.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "Calculates GST, CGST, and SGST for a given amount and rate, showing tax breakdown and total after-tax amount.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Computes home loan EMI, total interest, and repayment using principal, rate, and tenure inputs.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with hero content, navigation buttons, and feature cards for financial education resources.",
  "frontend/src/pages/HRACalculatorPage.tsx": "Calculates HRA exemption and taxable components based on salary, rent, DA, and city type with formatted results.",
  "frontend/src/pages/LearningPage.tsx": "Displays financial learning sections fetched from an API with collapsible content and loading states.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Calculates lump-sum investment maturity and gains using compound interest and shows results with charts and schedules.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "A React page that calculates NPS corpus, annuity amount, and monthly pension based on user inputs and displays results with form controls.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "A calculator page for NSC returns that computes maturity value and interest earned using compound interest inputs.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "A PPF calculator page that computes total invested amount, interest earned, and maturity value using yearly contributions and shows a breakdown chart.",
  "frontend/src/pages/RDCalculatorPage.tsx": "A Recurring Deposit calculator that computes total deposits, interest earned, and maturity value using monthly contributions and compound growth.",
  "frontend/src/pages/RegulationsPage.tsx": "A static informational page displaying SEBI, RBI, and fraud awareness guidelines using tabbed sections and alerts.",
  "frontend/src/pages/ResearchPapersPage.tsx": "A page that fetches and lists research papers with download links, showing loading and empty states as needed.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "Simple interest calculator page computing interest and total amount from principal, rate, and time inputs.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "Page that compares simple and compound interest, calculating maturity values and the difference based on compounding frequency.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "React page for calculating SIP future value, invested amount, returns, and generating a monthly contribution schedule.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "React page that computes SSY maturity value, investment duration, and interest based on yearly deposits and the child's age.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "React page implementing step-up SIP calculators for amount and percentage modes, including state handling, calculation logic, and UI layout.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "React page that simulates systematic withdrawals from an investment, calculating total withdrawn, final balance, and net gain or loss.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "React page for calculating XIRR using user-defined dated cash flows with add/remove functionality and a Newton-Raphson solver.",
  "frontend/src/utils/arthSaathiChat.ts": "Utility functions for detecting language, intent, and building refusal responses for the ArthSaathi chat assistant.",
  "frontend/src/utils/assetPaths.ts": "Centralized helper for generating static asset URLs using Vite's base path, plus brand constants.",
  "frontend/src/utils/cashFlowSchedules.ts": "Helpers for generating cash flow schedules, labels, and running balances for calculator components.",
  "frontend/src/utils/csv.ts": "Client-side CSV creation utilities including field escaping, array-to-CSV conversion, and download triggering.",
  "frontend/src/utils/formatters.ts": "Formatting utilities for INR currency, Indian-style numbers, and percentage strings.",
  "frontend/src/utils/glossaryFormatting.ts": "Parses glossary definitions to extract main content and references, with normalization helpers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values for routing.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom fonts, OKLCH color tokens, container settings, extended animations, and plugin integration for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s versioned state, high-level summary, and a list of implemented frontend and backend features including routing, theming, authentication, RBAC, maintenance mode, and content APIs."
}