{
  "backend/main.mo": "Defines the backend canister actor with data models for users, glossary, articles, research papers, learning content, market data, blogs, and includes authorization, storage mixins, and maintenance checks.",
  "feature_evidence.json": "Contains feature evidence entries describing logo and favicon replacement features with component lists and test IDs.",
  "frontend-file-summaries.txt": "Lists short summaries for all major frontend files including components, pages, hooks, and global styling.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation outlining the step‑by‑step procedure for retrying deployments and capturing logs.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "Base HTML template loading fonts, setting the favicon, and mounting the frontend app.",
  "frontend/scripts/README.md": "Overview of deployment helper scripts, highlighting the retry build‑and‑deploy script.",
  "frontend/scripts/retry-build-and-deploy-with-logs.sh": "Shell script automating staged deployment with full logging and error handling.",
  "frontend/src/App.tsx": "Main React app with routing, maintenance handling, theme provider, query client, and calculator/blog/learning routes.",
  "frontend/src/components/calculators/ResultBreakdownBarChart.tsx": "Empty placeholder file for a bar chart component.",
  "frontend/src/components/calculators/ResultBreakdownPieChart.tsx": "Pie chart component rendering investment vs returns breakdown using an SVG donut and summary labels.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Interactive chat widget handling user messages, intent detection, refusal logic, backend querying, and displaying assistant replies with optional disclaimers.",
  "frontend/src/components/domain/CustomDomainFaq.tsx": "Empty placeholder file for custom-domain FAQ content.",
  "frontend/src/components/domain/CustomDomainGuide.tsx": "Empty placeholder file for a custom-domain setup guide.",
  "frontend/src/components/Footer.tsx": "Footer showing dynamic NIFTY 50 market ticker with market-hours detection and stock price display using scrolling UI.",
  "frontend/src/components/GlossaryBackupRestorePanel.tsx": "UI panel to export, import, validate, and restore glossary snapshots with merge/replace options and confirmation flows.",
  "frontend/src/components/Header.tsx": "App header with navigation, theme toggle, mobile menu, authentication handling, and route-aware menu highlighting.",
  "frontend/src/components/MaintenanceScreen.tsx": "Simple full-page maintenance notice with branding, icon, and message for downtime periods.",
  "frontend/src/hooks/useActor.ts": "Hook creating an authenticated or anonymous backend actor, syncing with identity changes, and refreshing dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for Internet Identity authentication using AuthClient, managing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for interacting with backend actors, including maintenance checks, user profiles, glossary lookups, chat requests, and category-based article retrieval.",
  "frontend/src/index.css": "Defines Tailwind base layers and a full set of light/dark theme tokens for a finance-oriented UI using custom OKLCH variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App with global styling.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and philosophy cards using styled UI components and icons.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays article categories in tabs and lists fetched articles per category using React Query.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Implements an APY calculator page allowing users to estimate contributions based on age and desired pension with a UI for inputs and results.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog post by ID with metadata, tags, and error/loading handling.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all blogs with cards, handling loading and errors, and links to individual blog details.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Provides a CAGR calculator with user inputs and displays calculated investment growth rate.",
  "frontend/src/pages/CalculatorsPage.tsx": "Shows categorized navigation cards for various financial calculators.",
  "frontend/src/pages/ContactPage.tsx": "Offers a contact and feedback form with email info and submission via backend actor.",
  "frontend/src/pages/DisclaimerPage.tsx": "Displays legal disclaimers and warnings about financial content and investment risks.",
  "frontend/src/pages/DomainNamePage.tsx": "Empty file with no implemented content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "A React page that computes EMI, total interest, and total repayment based on loan amount, interest rate, and tenure, and displays results with input controls.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "A React EPF calculator that computes employee/employer contributions, interest accumulation, and maturity balance using monthly compounding.",
  "frontend/src/pages/FDCalculatorPage.tsx": "A fixed‑deposit calculator supporting simple and compound interest to compute maturity amount and interest earned from user inputs.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "An admin panel that authenticates users, checks admin status, and provides searchable, sortable access to all feedback entries.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "A loan comparison tool calculating fixed‑interest vs reducing‑balance totals and interest differences from user‑entered loan parameters.",
  "frontend/src/pages/GlossaryPage.tsx": "Implements a searchable glossary with grouping, admin backup/restore, error handling, and term reference navigation.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Calculates gratuity based on last drawn salary and years of service, showing eligibility and formatted results.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "Provides a GST calculator with inputs for amount and GST rate, computing CGST, SGST, total tax, and final amount.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Calculates home loan EMI, total repayment, and interest using loan amount, interest rate, and tenure inputs.",
  "frontend/src/pages/HomePage.tsx": "Landing page with a hero section, feature cards, navigation buttons, and a promotional finance-learning image.",
  "frontend/src/pages/HRACalculatorPage.tsx": "Computes HRA exemption using salary details, rent, and city type, displaying exempt and taxable portions.",
  "frontend/src/pages/LearningPage.tsx": "Loads learning sections and displays them in an accordion with loading and empty states.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Provides a compound-interest lump sum calculator with inputs, results, and a breakdown chart.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "Calculates projected NPS corpus, annuity amount, and monthly pension based on user inputs.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "Computes NSC maturity value and interest earned using compound interest from user-provided parameters.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "Simulates PPF growth with yearly contributions and interest to show total investment, returns, and maturity value.",
  "frontend/src/pages/RDCalculatorPage.tsx": "Provides a recurring deposit calculator with monthly inputs, computes maturity, interest, and total deposited, and displays results with form controls.",
  "frontend/src/pages/RegulationsPage.tsx": "Displays SEBI/RBI regulatory info, investor protection details, and fraud awareness using tabs and alerts.",
  "frontend/src/pages/ResearchPapersPage.tsx": "Fetches and lists research papers with loading states and PDF download functionality.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "React page that calculates simple interest from principal, rate, and time inputs and displays results formatted as INR.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "Compares simple and compound interest based on principal, rate, time, and compounding frequency, returning interest values and differences.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "Implements a SIP calculator using standard future value formula and shows invested amount, returns, and total value.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "Calculates Sukanya Samriddhi Yojana maturity value based on yearly deposits, girl’s age, and fixed interest rate.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "Provides step-up SIP calculations using either fixed amount or percentage increases, computing invested amount, total value, and returns.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "Simulates systematic withdrawal planning by projecting monthly withdrawals, portfolio growth, and final balance.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "Calculates XIRR for irregular dated cash flows using a Newton-Raphson approximation, with UI to add, edit, and remove entries.",
  "frontend/src/utils/arthSaathiChat.ts": "Utility functions for detecting language, intent types, and generating safe responses for a finance education chat assistant.",
  "frontend/src/utils/formatters.ts": "Formatting utilities for INR currency, Indian-number formatting, and percentage display.",
  "frontend/src/utils/glossaryFormatting.ts": "Parses glossary definitions to extract main content and ‘also read’ references and provides helpers for term normalization and lookup.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including from hash routing), persist them in sessionStorage, and clear them, with fallback and error handling.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom themes, colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Describes the project's versioned state, summarizing features of a React+TypeScript app backed by a Motoko canister with authentication, RBAC, maintenance mode, content modules, and UI capabilities."
}