{
  "backend/main.mo": "Defines the backend canister with data models, maps, IDs, and state for users, glossary, articles, research papers, learning sections, feedback, market data, and blogs, including authorization and storage mixins.",
  "feature_evidence.json": "Lists feature evidence for adding a donut chart component and replacing bar chart usage, mapping each feature to modified files and related components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing their purpose, UI roles, and behavior across pages and components.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH theme tokens for light and dark mode, applying global background, text, and border styling.",
  "frontend/index.html": "HTML entry point setting up fonts, metadata, root div, and loading the main React script.",
  "frontend/src/App.tsx": "Main React app wiring router, theme provider, maintenance wrapper, layout components, calculators, blog pages, and query client.",
  "frontend/src/components/calculators/ResultBreakdownBarChart.tsx": "Empty placeholder file for a bar chart component.",
  "frontend/src/components/calculators/ResultBreakdownPieChart.tsx": "Pie chart component rendering invested vs earned amounts using SVG donut segments with labels and zero-state handling.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Implements an interactive chat assistant with intent detection, backend chat queries, UI controls, message history, and disclaimers.",
  "frontend/src/components/Footer.tsx": "Footer component showing NIFTY 50 market ticker with live/closed status and scrolling stock prices based on client-side IST market-hours detection.",
  "frontend/src/components/GlossaryBackupRestorePanel.tsx": "UI panel for exporting glossary snapshots and restoring them via merge or replace, including file parsing, validation, and confirmation flows.",
  "frontend/src/components/Header.tsx": "Main site header with navigation, theme toggle, mobile menu, and Internet Identity login/logout handling.",
  "frontend/src/components/MaintenanceScreen.tsx": "Full-page maintenance notice with logo, icon, and explanatory message.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages backend actors based on Internet Identity, auto-invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity authentication, handling login, logout, stored identity loading, and exposing status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for maintenance mode, admin checks, user profiles, chat, glossary, and other backend‑driven data interactions.",
  "frontend/src/index.css": "Provides Tailwind base layers and detailed light/dark theme tokens for the app’s design system.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and philosophy sections using styled cards and icons.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays article categories with tabbed navigation and loads articles by category using React Query.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Implements an APY calculator that computes contributions based on age and desired pension with a UI for inputs and results.",
  "frontend/src/pages/BlogDetailPage.tsx": "Fetches and displays a blog post with metadata, tags, content, and error handling for loading states.",
  "frontend/src/pages/BlogsPage.tsx": "Displays a list of blogs with loading and error states, showing cards that link to individual blog pages.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Provides a form to calculate CAGR based on initial value, final value, and years, with formatted results.",
  "frontend/src/pages/CalculatorsPage.tsx": "Shows categorized lists of financial calculators and navigates users to each calculator’s page.",
  "frontend/src/pages/ContactPage.tsx": "Renders contact information and a feedback form that submits user messages via a mutation hook.",
  "frontend/src/pages/DisclaimerPage.tsx": "Presents legal disclaimers and warnings about investment risks and the educational nature of the site's content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "Interactive EMI calculator page that computes monthly payments, total interest, and repayment based on loan inputs.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "EPF calculator page that estimates contributions, interest, and maturity balance using salary and rate inputs.",
  "frontend/src/pages/FDCalculatorPage.tsx": "FD calculator page that calculates maturity amount and interest using simple or compound interest options.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "Admin dashboard for viewing, filtering, and sorting user feedback with authentication and authorization checks.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "Comparison tool that calculates fixed-interest vs reducing-balance loan costs and highlights interest differences.",
  "frontend/src/pages/GlossaryPage.tsx": "Implements a searchable glossary with grouped terms, admin backup/restore, error handling, and reference navigation.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Calculates gratuity using salary and years of service with eligibility checks and formatted output.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "Provides a GST calculator that computes CGST, SGST, total tax, and final amount based on user inputs.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Computes home loan EMI, total repayment, and interest based on principal, rate, and tenure.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content, feature cards, and navigation to learning, glossary, and research sections.",
  "frontend/src/pages/HRACalculatorPage.tsx": "Calculates HRA exemption and taxable HRA using salary components, rent, and city type.",
  "frontend/src/pages/LearningPage.tsx": "Displays financial learning sections using an accordion, loading states, and data from useGetAllLearningSections.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Provides a lump‑sum investment calculator using compound interest with user inputs and result display.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "Calculates NPS corpus, annuity amount, and monthly pension based on user inputs and retirement parameters.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "Computes NSC maturity value and interest earned using compound interest from user‑provided investment data.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "Calculates PPF maturity, interest earned, and total invested using yearly contributions and compounding logic.",
  "frontend/src/pages/RDCalculatorPage.tsx": "Provides a recurring deposit calculator with inputs for monthly investment, interest rate, and tenure, computing maturity value and displaying results.",
  "frontend/src/pages/RegulationsPage.tsx": "Displays SEBI and RBI regulatory information with tabs, alerts, and investor protection guidelines.",
  "frontend/src/pages/ResearchPapersPage.tsx": "Fetches and lists research papers with loading states, showing details and providing PDF downloads.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "A React page providing a simple‑interest calculator with inputs for principal, rate, and time, displaying computed interest and total amount.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "A comparison calculator page that computes simple and compound interest, including compounding frequency, and shows the difference between them.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "Implements a SIP calculator that computes future value based on monthly investment, return rate, and duration with a results breakdown chart.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "Calculates Sukanya Samriddhi Yojana maturity value using yearly investment, child age, and fixed interest rate.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "A step‑up SIP calculator page offering amount‑based and percentage‑based step‑up projections, computing total value, invested amount, and returns.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "Provides a Systematic Withdrawal Plan calculator that simulates monthly withdrawals, growth, and remaining balance over time.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "An XIRR calculator page allowing multiple dated cash flows and estimating XIRR using a Newton‑Raphson approximation.",
  "frontend/src/utils/arthSaathiChat.ts": "Utilities for detecting language, intent, and generating safe responses for the ArthSaathi chat assistant.",
  "frontend/src/utils/formatters.ts": "Shared formatting helpers for INR currency, Indian‑style numbers, and percentages.",
  "frontend/src/utils/glossaryFormatting.ts": "Parser utilities for glossary definitions, extracting main text and 'Also read' references, with normalization helpers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the hash for state handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended typography, custom colors, container settings, animations, and plugin integrations.",
  "project_state.json": "Describes the project’s architecture, features, and versioned state for a React + TypeScript app backed by a Motoko canister."
}