{
  "backend/main.mo": "Motoko canister defining data types and maps for users, content (glossary, articles, papers, blogs), market data, and chat responses, with maintenance-mode checks and initial chat/utility functions.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs for blogs UI, navigation updates, and blog React Query hooks.",
  "frontend-file-summaries.txt": "Text file providing human-written summaries of many frontend files including pages, components, hooks, and styling.",
  "frontend/index.css": "Global Tailwind CSS theme configuration defining OKLCH color variables and dark/light mode tokens.",
  "frontend/index.html": "Base HTML entry file loading the React app and favicon.",
  "frontend/src/App.tsx": "Main React root with router setup, pages including blog routes, maintenance gating, and global layout components like header, footer, and chat widget.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Interactive chat widget handling user messages, intent detection, backend calls, disclaimers, and rendering chat UI with source-based responses.",
  "frontend/src/components/Footer.tsx": "Renders a footer with a NIFTY 50 ticker, determining live vs closed market status client‑side and displaying stock prices accordingly.",
  "frontend/src/components/Header.tsx": "Implements a responsive header with navigation, theme toggle, calculators menu, and Internet Identity login/logout handling.",
  "frontend/src/components/MaintenanceScreen.tsx": "Displays a full‑screen maintenance notice with branding and basic messaging.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity auth, including initialization, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for maintenance mode, admin status, user profiles, stock data, glossary data, and chat interactions using the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus extensive CSS variables for light/dark themes and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it in QueryClient and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and education philosophy sections using cards and icons.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays categorized financial articles with tab navigation and loads articles per category via a query hook.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Implements an APY calculator that computes monthly contribution, total contribution, and corpus based on age and desired pension.",
  "frontend/src/pages/BlogDetailPage.tsx": "Fetches and displays a single blog post with metadata, tags, and formatted dates, handling loading and error states.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all blogs with titles, previews, dates, categories, and tags, including loading and error handling.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Provides a CAGR calculator that computes annual growth rate from initial value, final value, and time period.",
  "frontend/src/pages/CalculatorsPage.tsx": "Displays categorized lists of financial calculators with icons and navigation links.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact info and a feedback form that submits user messages via a custom hook.",
  "frontend/src/pages/DisclaimerPage.tsx": "Shows legal disclaimers about investment risks and clarifies the site provides only educational content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "Implements an EMI calculator with inputs for loan details and computed EMI, interest, and repayment.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "Calculates EPF contributions and projected balance based on salary, contribution rates, interest, and tenure.",
  "frontend/src/pages/FDCalculatorPage.tsx": "Provides a fixed deposit calculator with simple and compound interest options, displaying maturity and interest earned based on user inputs.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "Implements an admin feedback management panel with authentication, search, sorting, and loading/error states.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "Calculates and compares fixed-rate and reducing-balance loan interest, showing total repayment and interest difference.",
  "frontend/src/pages/GlossaryPage.tsx": "Displays a searchable, grouped glossary of financial terms with error handling and reference navigation.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Provides a gratuity calculator using salary and years of service with eligibility checks and formatted output.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "Computes GST breakdown including CGST, SGST, total tax, and final amount for a given base value and rate.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Calculates home loan EMI, total interest, and repayment using principal, rate, and tenure inputs.",
  "frontend/src/pages/HomePage.tsx": "Displays the main landing page with hero content, navigation buttons, and feature cards for learning resources.",
  "frontend/src/pages/HRACalculatorPage.tsx": "Implements an HRA tax exemption calculator based on salary, rent, and city type with detailed breakdown.",
  "frontend/src/pages/LearningPage.tsx": "Renders financial learning sections from an API with accordion-based content and loading states.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Offers a lump-sum investment calculator using compound interest to show maturity value and gains.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "Interactive NPS calculator page that computes projected corpus, annuity amount, and monthly pension based on user inputs.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "NSC calculator page that calculates maturity value and interest earned from fixed-rate NSC investments.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "PPF calculator page computing total invested amount, interest earned, and maturity value for yearly contributions.",
  "frontend/src/pages/RDCalculatorPage.tsx": "RD calculator page estimating maturity amount, total deposits, and interest for recurring monthly investments.",
  "frontend/src/pages/RegulationsPage.tsx": "Static regulations page presenting SEBI/RBI guidelines, investor protection info, and fraud awareness through tabbed content.",
  "frontend/src/pages/ResearchPapersPage.tsx": "Fetches and displays research papers with download links, showing loading and empty states as needed.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "A simple interest calculator taking principal, rate, and time to compute interest and total amount.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "A comparison tool that calculates simple and compound interest with configurable compounding frequency and shows the difference.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "A SIP calculator page that takes monthly investment, rate, and years, computes future value using compounding, and displays results with input controls.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "An SSY calculator allowing yearly investment, child age, and start year to compute deposit years and maturity value using fixed SSY interest.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "React page providing step-up SIP calculators using amount or percentage increases with compound growth logic and formatted results.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "An SWP calculator that simulates month‑by‑month withdrawals, growth, and remaining balance based on initial investment and return rate.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "React page that manages user cash flows and computes XIRR via a Newton-Raphson approximation.",
  "frontend/src/utils/arthSaathiChat.ts": "Utility functions for detecting language, intent, and generating refusal messages for the ArthSaathi chat assistant.",
  "frontend/src/utils/glossaryFormatting.ts": "Parses glossary definitions to extract main text and 'Also read' references and normalizes term names.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin usage.",
  "project_state.json": "Defines project metadata, a high‑level platform summary, and a detailed list of existing frontend and backend features including routing, theming, authentication, access control, and maintenance mode."
}