{
  "backend/main.mo": "Defines the backend canister with data models for glossary, articles, research papers, market data, blogs, and access control, along with initialization of in‑memory maps and IDs.",
  "feature_evidence.json": "Feature evidence report listing implemented glossary bulk-import admin features with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists short summaries for major frontend files describing their purpose, UI behavior, and integration with backend queries.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation describing deployment retry steps, troubleshooting, and asset verification for the application.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme tokens, OKLCH color variables, and dark mode overrides.",
  "frontend/index.html": "HTML entry file configuring fonts, icons, metadata, root mount point, and script loading for the frontend app.",
  "frontend/scripts/README.md": "Explains available deployment helper scripts and their purpose.",
  "frontend/scripts/retry-build-and-deploy-with-logs.sh": "Shell script automating multi-stage build and deployment with logging and error handling.",
  "frontend/src/App.tsx": "Sets up React Query, theming, routing, and maintenance-mode gating while rendering the main layout with header, footer, and chat widget.",
  "frontend/src/components/BrandLogo.tsx": "Renders the brand logo with error handling and a text fallback when the image fails to load.",
  "frontend/src/components/calculators/CashFlowSection.tsx": "Reusable cash‑flow table component with optional running balance and CSV export support.",
  "frontend/src/components/calculators/ResultBreakdownBarChart.tsx": "Placeholder file intended for a bar chart breakdown component; currently empty.",
  "frontend/src/components/calculators/ResultBreakdownPieChart.tsx": "Generates an SVG donut chart showing invested vs earned amounts with percentage calculations and empty‑state handling.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Implements an on-page chat assistant with intent detection, backend calls, message state, and disclaimers.",
  "frontend/src/components/domain/CustomDomainFaq.tsx": "Empty placeholder for a custom‑domain FAQ component.",
  "frontend/src/components/domain/CustomDomainGuide.tsx": "Empty placeholder for a custom‑domain setup guide component.",
  "frontend/src/components/Footer.tsx": "Displays a dynamic NIFTY 50 ticker based on Indian market hours along with footer UI elements.",
  "frontend/src/components/GlossaryBackupRestorePanel.tsx": "Provides UI to export, import, validate, and restore glossary snapshot files with merge or replace options.",
  "frontend/src/components/GlossaryBulkImportCTermsPanel.tsx": "Allows bulk publishing of predefined C‑terms to the glossary with confirmation and status feedback.",
  "frontend/src/components/Header.tsx": "Navigation header with theme toggle, auth actions via Internet Identity, and dynamic menu lists including calculators and admin pages.",
  "frontend/src/components/MaintenanceScreen.tsx": "Full‑screen maintenance notice showing brand logo, icon, and explanatory text.",
  "frontend/src/data/glossaryBulkImportC.ts": "Static batch of glossary entries for C‑terms used for bulk importing into the backend.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, managing login, logout, identity persistence, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Contains multiple React Query hooks for fetching and mutating data from the backend actor, including maintenance mode, user profiles, chat, glossary, and more.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark theme customization using OKLCH color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and philosophy sections using styled cards and icons.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays categorized financial articles using tabs and fetches articles per category via React Query.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Provides an APY calculator that computes monthly contributions and corpus based on age and desired pension.",
  "frontend/src/pages/BlogDetailPage.tsx": "Loads and displays a single blog post with metadata, tags, content, and fallback error handling.",
  "frontend/src/pages/BlogsPage.tsx": "Displays a list of blogs with loading and error states, showing blog cards with metadata and navigation to individual posts.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Provides a CAGR calculator with user inputs for values and years, computes the growth rate, and displays the result.",
  "frontend/src/pages/CalculatorsPage.tsx": "Lists categorized financial calculators with icons, descriptions, and navigation links.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact and feedback form, submitting feedback via a backend actor and showing email contact options.",
  "frontend/src/pages/DisclaimerPage.tsx": "Shows legal disclaimers and risk warnings about financial content, emphasizing educational purpose only.",
  "frontend/src/pages/DomainNamePage.tsx": "Empty or placeholder page with no implemented content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "Provides an EMI calculator that computes monthly payments, total interest, and total repayment based on loan inputs.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "Implements an EPF calculator computing contributions, interest, and maturity balance using salary and rate inputs.",
  "frontend/src/pages/FDCalculatorPage.tsx": "Generates simple or compound interest FD calculations to show maturity amount and interest earned.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "Displays an admin-only feedback management panel with authentication, search, sorting, and table rendering.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "Compares fixed-rate vs reducing-balance loan costs by calculating total interest and repayment for each method.",
  "frontend/src/pages/GlossaryPage.tsx": "Glossary search page that fetches, groups, and displays financial terms with admin tools for backup and bulk import.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Calculator page that computes gratuity based on last salary and years of service using the standard gratuity formula.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "React page that collects amount and GST rate to compute CGST, SGST, total tax, and final amount.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Home loan EMI calculator that computes EMI, total interest, and repayment based on loan amount, interest rate, and tenure.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, feature sections, and navigation buttons to learning, glossary, and research pages.",
  "frontend/src/pages/HRACalculatorPage.tsx": "HRA calculator that computes exempt and taxable HRA based on salary, DA, rent paid, and metro/non‑metro rules.",
  "frontend/src/pages/LearningPage.tsx": "Displays structured financial education sections using an accordion, loading states, and fetched content.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Provides a lump‑sum investment calculator using compound interest, input fields, and result visualization.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "Calculates NPS corpus, annuity portion, and monthly pension based on user inputs for contributions and age.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "Computes NSC maturity value and interest earned using compound interest with user‑provided inputs.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "Implements a PPF return calculator computing total invested, interest earned, and maturity value over the tenure.",
  "frontend/src/pages/RDCalculatorPage.tsx": "Recurring Deposit calculator page with inputs for monthly amount, rate, and tenure, computing deposit, interest, and maturity values.",
  "frontend/src/pages/RegulationsPage.tsx": "Displays SEBI/RBI guidelines and fraud awareness info with tabs and regulatory content sections.",
  "frontend/src/pages/ResearchPapersPage.tsx": "Fetches and lists research papers with download links, handling loading and empty states.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "Page component that calculates simple interest from principal, rate, and time inputs and displays formatted results.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "Page that compares simple and compound interest based on user inputs including compounding frequency and shows the difference.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "SIP calculator page computing future value, invested amount, and returns with optional cash flow charts.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "Sukanya Samriddhi Yojana calculator computing maturity value, deposit years, and interest based on yearly contributions.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "Page providing step-up SIP calculations by amount or percentage, computing total value, invested amount, and returns.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "SWP calculator simulating monthly withdrawals, balance growth, and final corpus over a chosen duration.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "Page to compute XIRR using user-defined dated cash flows and a Newton-Raphson approximation.",
  "frontend/src/utils/arthSaathiChat.ts": "Utility functions for detecting language, intent, and generating refusal responses for the ArthSaathi chat assistant.",
  "frontend/src/utils/assetPaths.ts": "Centralized helper for generating asset URLs using Vite’s base path handling and storing brand asset paths.",
  "frontend/src/utils/cashFlowSchedules.ts": "Utility functions to generate cash flow labels and schedules, including monthly/yearly contributions and running balances.",
  "frontend/src/utils/csv.ts": "Provides CSV field escaping, array-to-CSV conversion, and browser CSV download helpers.",
  "frontend/src/utils/formatters.ts": "Contains number, currency (INR), and percentage formatting utilities using Indian conventions.",
  "frontend/src/utils/glossaryFormatting.ts": "Parses glossary definitions to extract main text and 'Also read' references and normalizes term names.",
  "frontend/src/utils/glossaryKey.ts": "Generates deterministic normalized keys for glossary terms and maps terms to backend-compatible keys.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter extraction, session persistence, and safe parameter removal for both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugin setup for the frontend.",
  "project_state.json": "Describes current project state, issues, and feature requests for glossary and blog management."
}