{
  "backend/main.mo": "Defines the backend actor with authorization mixins, storage mixins, data models, and in-memory maps for glossary, articles, research papers, market data, blogs, and user profiles.",
  "feature_evidence.json": "Feature evidence report linking the market ticker feature to frontend files, components, and test requirements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all major frontend files including pages, components, hooks, and styles.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation describing how to retry deployments, build assets, and troubleshoot common deployment issues.",
  "frontend/index.css": "Tailwind base/theme configuration defining OKLCH design tokens for light and dark modes and applying global background/foreground styles.",
  "frontend/index.html": "HTML entry point setting up fonts, favicons, meta tags, and mounting the React root.",
  "frontend/scripts/README.md": "Explains available deployment helper scripts and their purpose.",
  "frontend/scripts/retry-build-and-deploy-with-logs.sh": "Shell script automating full frontend and backend build/deploy stages with timestamped logging and error handling.",
  "frontend/src/App.tsx": "Main React app configuring router, theme, query client, maintenance-mode wrapper, global layout, and page routing.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo with error handling and a text fallback when the image fails to load.",
  "frontend/src/components/calculators/CashFlowSection.tsx": "Renders a cash‑flow table with optional running balance and supports CSV download; shows an empty state when no rows exist.",
  "frontend/src/components/calculators/ResultBreakdownBarChart.tsx": "Empty file placeholder for a bar chart component.",
  "frontend/src/components/calculators/ResultBreakdownPieChart.tsx": "Displays an investment breakdown donut chart with invested and earned segments, handling zero‑data states.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Implements an interactive chat widget with intent detection, disclaimers, backend queries, and dynamic message handling.",
  "frontend/src/components/domain/CustomDomainFaq.tsx": "Empty placeholder for a custom domain FAQ component.",
  "frontend/src/components/domain/CustomDomainGuide.tsx": "Empty placeholder for a custom domain setup guide component.",
  "frontend/src/components/Footer.tsx": "Renders a footer containing a live or closing NIFTY 50 stock ticker with loading and error states.",
  "frontend/src/components/GlossaryBackupRestorePanel.tsx": "Provides UI for exporting, validating, and restoring glossary snapshots with merge or replace options.",
  "frontend/src/components/GlossaryBulkImportCTermsPanel.tsx": "Offers a panel to publish a predefined batch of C-prefix glossary terms with confirmation and status handling.",
  "frontend/src/components/Header.tsx": "Creates a responsive header with navigation, theme switching, authentication handling, and calculator menus.",
  "frontend/src/components/MaintenanceScreen.tsx": "Shows a branded maintenance screen informing users the site is temporarily unavailable.",
  "frontend/src/data/glossaryBulkImportC.ts": "Provides a version‑controlled list of glossary terms beginning with C for bulk backend import.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for calling backend methods, including maintenance checks, user profile operations, chat, and glossary queries.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables for colors, spacing, and UI tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and philosophy sections using styled cards and icons.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays categorized financial articles with tabs and fetches articles per category via a query hook.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Implements an APY calculator that computes contributions based on age and desired pension using an approximate matrix.",
  "frontend/src/pages/BlogDetailPage.tsx": "Shows a single blog post with metadata, tags, and loading/error states fetched via a blog query.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all blog posts with summaries and metadata, handling loading and error states and enabling navigation to details.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Interactive CAGR calculator page allowing users to input initial value, final value, and years to compute annualized growth.",
  "frontend/src/pages/CalculatorsPage.tsx": "Displays categorized lists of financial calculators with navigation links and icons.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page that sends feedback via a mutation hook and shows contact options like email and Instagram.",
  "frontend/src/pages/DisclaimerPage.tsx": "Shows legal disclaimers and warnings about investment risks and clarifies the educational purpose of the site.",
  "frontend/src/pages/DomainNamePage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "Loan EMI calculator page that computes monthly EMI, total interest, and repayment based on user inputs.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "React page that calculates EPF maturity using employee/employer contributions, interest compounding, and displays results with form inputs.",
  "frontend/src/pages/FDCalculatorPage.tsx": "React page for FD maturity calculation supporting simple and quarterly compound interest with user inputs and displayed results.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "Admin panel for viewing, filtering, and sorting feedback with authentication, authorization checks, and storage usage display.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "React page comparing fixed-rate and reducing-balance loan interest, computing totals and differences based on user inputs.",
  "frontend/src/pages/GlossaryPage.tsx": "Renders glossary terms with search, grouping, admin diagnostics, and tools for backup/restore and bulk import.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Provides an Indian gratuity calculator using salary and years of service with eligibility checks and formatted output.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "GST calculator page computing CGST, SGST, total tax, and final amount from a base amount and GST rate.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Calculates home loan EMI, interest, and total repayment based on loan amount, interest rate, and tenure.",
  "frontend/src/pages/HomePage.tsx": "Displays the main landing page with hero content, navigation buttons, and feature sections for learning, glossary, and research.",
  "frontend/src/pages/HRACalculatorPage.tsx": "Implements an HRA tax exemption calculator using salary, DA, rent, and city type inputs with computed exempt and taxable amounts.",
  "frontend/src/pages/LearningPage.tsx": "Renders a learning page that loads sections, matches them to selected topics, and auto-scrolls to the relevant section.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Provides a lump sum investment calculator using compound interest with input fields, results, and a cash flow schedule.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "Calculates NPS corpus, annuity amount, and monthly pension based on contribution, age, and return inputs.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "Computes NSC maturity value and interest using compound interest based on investment, rate, and duration.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "Calculates PPF maturity, interest earned, and total investment through yearly contributions and annual compounding.",
  "frontend/src/pages/RDCalculatorPage.tsx": "React page providing a recurring deposit calculator with inputs for monthly investment, interest rate, and tenure, computing maturity value and interest.",
  "frontend/src/pages/RegulationsPage.tsx": "Static informational page displaying SEBI and RBI guidelines, investor protection details, and fraud awareness using tabs and alerts.",
  "frontend/src/pages/ResearchPapersPage.tsx": "Page fetching and listing research papers with download links, showing loading and empty states when needed.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "Renders a simple interest calculator page with inputs for principal, rate, and time, and computes and displays simple interest and total amount.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "Provides a comparison tool for simple vs compound interest with inputs including compounding frequency and displays both results and their difference.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "SIP calculator page that computes future value based on monthly contributions, rate, and duration, and shows cash‑flow details.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "SSY calculator computing maturity amount based on yearly deposits, girl's age, and fixed scheme interest rate.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "Implements step-up SIP calculators for amount-based and percentage-based increases, computing invested amount, total value, and returns over time.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "SWP calculator simulating monthly withdrawals, returns, and remaining balance over a set duration.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "Renders an XIRR calculator allowing multiple dated cash flows and computes XIRR using a Newton–Raphson approximation.",
  "frontend/src/utils/arthSaathiChat.ts": "Contains language, recommendation, tax/legal intent detection and builds refusal responses for a finance education assistant.",
  "frontend/src/utils/assetPaths.ts": "Generates asset URLs using Vite base path and exposes centralized static asset paths and brand constants.",
  "frontend/src/utils/cashFlowSchedules.ts": "Provides helpers to generate monthly/yearly labels and build cash flow schedules including running balances and maturity rows.",
  "frontend/src/utils/csv.ts": "Provides CSV field escaping, array-to-CSV conversion, and client-side CSV download utilities.",
  "frontend/src/utils/formatters.ts": "Contains number, currency, percentage, and byte-size formatting helpers using Indian conventions.",
  "frontend/src/utils/glossaryFormatting.ts": "Parses glossary definitions, extracts 'Also read' references, and normalizes terms for grouping and lookup.",
  "frontend/src/utils/glossaryKey.ts": "Generates deterministic normalized keys for glossary terms and converts terms to backend-safe keys.",
  "frontend/src/utils/learningTopics.ts": "Defines learning topic metadata and provides lookup utilities by slug or section title.",
  "frontend/src/utils/navStructure.ts": "Defines the grouped navigation structure used for menus across the UI.",
  "frontend/src/utils/urlParams.ts": "Handles URL and session parameter parsing, persistence, cleanup, and hash-based param extraction.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom themes, typography, colors, animations, and container settings.",
  "project_state.json": "Describes project state and feature requests for implementing NSE-sourced market ticker data."
}