{
  "backend/main.mo": "Defines actor state, data models, and maps for glossary, articles, research papers, blogs, market data, and user profiles with authorization and storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries detailing modified frontend files, related components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend components, pages, hooks, and styles.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation explaining staged deployment, verification, and troubleshooting steps for retrying app deployments.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens, dark mode values, and global styling rules.",
  "frontend/index.html": "HTML entry point configuring fonts, metadata, favicons, and mounting the React app.",
  "frontend/scripts/README.md": "Overview of deployment helper scripts including the retry build-and-deploy script.",
  "frontend/scripts/retry-build-and-deploy-with-logs.sh": "Bash script automating frontend build, backend build, and deployment with timestamped logs and stage output.",
  "frontend/src/App.tsx": "Sets up the app’s routing, theme, query client, and maintenance-mode gate, rendering header, footer, pages, and the chat widget.",
  "frontend/src/components/BrandLogo.tsx": "Renders the brand logo with error handling and a text fallback when the image fails to load.",
  "frontend/src/components/calculators/CashFlowSection.tsx": "Displays a cash‑flow table with optional running balance and CSV export, with empty‑state handling.",
  "frontend/src/components/calculators/ResultBreakdownBarChart.tsx": "Empty placeholder file for a bar chart component.",
  "frontend/src/components/calculators/ResultBreakdownPieChart.tsx": "Renders a donut‑style SVG pie chart showing invested vs earned amounts with fallback empty state.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Implements a floating chat assistant with intent detection, message handling, backend calls, and optional disclaimers.",
  "frontend/src/components/domain/CustomDomainFaq.tsx": "Empty placeholder file for custom‑domain FAQ content.",
  "frontend/src/components/domain/CustomDomainGuide.tsx": "Empty placeholder file for custom‑domain guide content.",
  "frontend/src/components/Footer.tsx": "Displays a footer with a live or closing NIFTY 50 stock ticker, handling loading and error states.",
  "frontend/src/components/GlossaryBackupRestorePanel.tsx": "Provides UI and logic to export, import, validate, and restore glossary snapshots with merge or replace options.",
  "frontend/src/components/GlossaryBulkImportCTermsPanel.tsx": "Offers a panel to publish a predefined batch of C‑terms to the glossary with confirmation and status feedback.",
  "frontend/src/components/Header.tsx": "Header component handling navigation, theme switching, user auth via Internet Identity, and mobile menu interactions.",
  "frontend/src/components/MaintenanceScreen.tsx": "Full‑screen maintenance page showing a logo, icon, status message, and footer.",
  "frontend/src/data/glossaryBulkImportC.ts": "Static glossary batch defining C‑terms and definitions for bulk import into the backend.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, providing login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for maintenance status, admin checks, user profiles, chat, and glossary operations using an actor-based backend.",
  "frontend/src/index.css": "Sets global Tailwind base styles and defines light and dark theme design tokens using custom CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and philosophy information using styled cards and icons.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays categorized financial articles with tabs and fetches article data per category via React Query.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Implements an APY calculator that computes required contributions based on age and desired pension using a preset matrix.",
  "frontend/src/pages/BlogDetailPage.tsx": "Fetches and displays a single blog post with metadata, tags, content, and error/loading states.",
  "frontend/src/pages/BlogsPage.tsx": "Displays a list of blogs with loading and error states, showing blog cards with dates, titles, excerpts, and tags that navigate to detailed pages.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Provides a form-based calculator for computing CAGR using initial value, final value, and time period inputs, with live result display.",
  "frontend/src/pages/CalculatorsPage.tsx": "Shows categorized lists of financial calculators, each linking to a dedicated tool with icons, descriptions, and navigation.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form integrated with feedback submission along with email and social contact cards, handling submission and form state.",
  "frontend/src/pages/DisclaimerPage.tsx": "Displays legal disclaimers, investment risk warnings, and notes clarifying that the site provides educational content, not financial advice.",
  "frontend/src/pages/DomainNamePage.tsx": "Empty page with no implemented content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "A React page that calculates EMI, total interest, and total repayment based on loan amount, rate, and tenure with input form UI.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "A React page for computing EPF contributions and maturity using salary, contribution rates, interest, and tenure with summarized results.",
  "frontend/src/pages/FDCalculatorPage.tsx": "A React page that calculates FD maturity and interest using simple or compound interest with user‑entered principal, rate, and tenure.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "Admin interface for viewing, filtering, and sorting feedback with authentication and storage usage info.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "A calculator page comparing fixed-rate and reducing-balance loan interest and repayment totals.",
  "frontend/src/pages/GlossaryPage.tsx": "Provides a searchable glossary with grouping, sorting, admin diagnostics, and reference linking. Fetches terms from backend hooks and displays grouped results with admin tools for validation and backup.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Calculates employee gratuity based on last drawn salary and years of service using the standard formula. Renders inputs, eligibility logic, and formatted gratuity output.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "Implements a GST calculator with inputs for amount and GST rate, computing CGST, SGST, total tax, and final amount. Includes UI for navigation, data entry, and formatted tax breakdown.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Implements a home loan EMI calculator computing EMI, total interest, and total repayment from loan amount, interest rate, and tenure. Provides input fields and displays calculated financial breakdown.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage layout with hero, features, and navigation buttons linking to learning, glossary, and research sections.",
  "frontend/src/pages/HRACalculatorPage.tsx": "Computes HRA exemption using salary components, rent, and city type, returning exempt and taxable HRA. Includes UI for salary inputs and displays calculated results.",
  "frontend/src/pages/LearningPage.tsx": "Displays structured learning sections, handles topic-based filtering, auto-scrolling, and shows matched or unmatched topic alerts.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Implements a lump sum investment calculator using compound interest and displays results, inputs, and a simple cash flow breakdown.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "Calculates NPS corpus, annuity amount, and monthly pension based on user inputs and renders related UI.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "Computes NSC maturity value and interest using compound interest and provides input fields with formatted result display.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "Provides a PPF calculator with yearly investment, tenure, and interest inputs and computes maturity, interest, and total invested.",
  "frontend/src/pages/RDCalculatorPage.tsx": "Implements an RD calculator using monthly deposits, interest rate, and tenure to compute maturity value and interest earned.",
  "frontend/src/pages/RegulationsPage.tsx": "Displays SEBI/RBI guidelines, fraud awareness info, and investor protection details using tabs and informational cards.",
  "frontend/src/pages/ResearchPapersPage.tsx": "Fetches and displays research papers with loading states and supports PDF downloads.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "Implements a simple interest calculator with inputs for principal, rate, and time, showing computed interest and total amount.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "Calculates and compares simple and compound interest using user inputs for principal, rate, time, and compounding frequency.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "Calculates SIP future value from monthly contributions, rate, and duration and shows results with charts and cash flow schedule.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "Runs SSY maturity calculations based on yearly investment, child's age, and fixed interest rate, outputting maturity value and deposit years.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "Offers step-up SIP calculations by amount or percentage, computing total value, invested amount, and returns over time.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "Provides a UI and logic to calculate systematic withdrawal plan results based on investment, withdrawal amount, return rate, and duration.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "Allows entry of multiple dated cash flows and computes XIRR using a Newton-Raphson approximation method.",
  "frontend/src/utils/arthSaathiChat.ts": "Provides language, intent, and calculator detection plus refusal message builders for the ArthSaathi chat assistant.",
  "frontend/src/utils/assetPaths.ts": "Generates asset URLs using Vite's base path and exports static asset paths and brand metadata.",
  "frontend/src/utils/cashFlowSchedules.ts": "Utilities for generating labels, cash‑flow schedules, and running balances used in calculators.",
  "frontend/src/utils/csv.ts": "Implements CSV escaping, CSV string generation, and client-side CSV download.",
  "frontend/src/utils/feedbackForm.ts": "Stores the Google feedback form URL and provides helpers to open or embed it.",
  "frontend/src/utils/formatters.ts": "Number formatting utilities including INR currency, Indian numbering, percentages, and byte sizes.",
  "frontend/src/utils/glossaryFormatting.ts": "Parses glossary definitions, extracts references, normalizes terms, groups terms, and resolves cross-references.",
  "frontend/src/utils/glossaryKey.ts": "Normalizes glossary terms into deterministic keys and exposes a helper to convert terms to backend keys.",
  "frontend/src/utils/learningTopics.ts": "Defines learning topics and provides lookup utilities by slug or section title.",
  "frontend/src/utils/navStructure.ts": "Defines the grouped navigation structure used across the app.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom fonts, OKLCH color variables, container settings, animations, and plugin imports.",
  "project_state.json": "Project metadata describing feature requests and state for embedding a Google Form in the Contact page’s Feedback section."
}