{
  "backend/main.mo": "Defines the backend canister with authorization, storage mixins, and data models for glossary terms, articles, research papers, learning sections, feedback, stocks, and blogs.",
  "feature_evidence.json": "Describes feature evidence linking frontend files to implemented features, components, and tests with confidence ratings.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files, detailing behavior, UI features, and application logic.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation explaining how to retry deployments and troubleshoot issues across build and deploy stages.",
  "frontend/index.css": "Tailwind base layer defining theme variables, dark mode values, and global background/foreground styling.",
  "frontend/index.html": "Base HTML template loading fonts, favicons, and mounting the root element for the frontend app.",
  "frontend/scripts/README.md": "README describing deployment helper scripts located in the scripts directory.",
  "frontend/scripts/retry-build-and-deploy-with-logs.sh": "Bash script automating build and deployment with logging, staged execution, and error handling.",
  "frontend/src/App.tsx": "Main React app with routing, theme provider, query client, lazy-loaded pages, and maintenance mode handling.",
  "frontend/src/components/AsyncChatAssistantWidget.tsx": "Lazy‑loads the chat widget after idle time or timeout, rendering it inside a Suspense boundary.",
  "frontend/src/components/BrandLogo.tsx": "Displays the brand logo image with error handling and a text fallback when loading fails.",
  "frontend/src/components/calculators/CashFlowSection.tsx": "Renders a cash flow table with optional running balance and supports CSV export; shows an empty state when no rows exist.",
  "frontend/src/components/calculators/ResultBreakdownBarChart.tsx": "Empty file placeholder for a bar chart component.",
  "frontend/src/components/calculators/ResultBreakdownPieChart.tsx": "Draws a donut-style SVG pie chart showing invested vs earned values with fallback empty state handling.",
  "frontend/src/components/ChatAssistantWidget.tsx": "Implements a full chat UI with intent detection, backend queries, disclaimers, and dynamic message handling.",
  "frontend/src/components/domain/CustomDomainFaq.tsx": "Empty file placeholder for a custom domain FAQ component.",
  "frontend/src/components/domain/CustomDomainGuide.tsx": "Empty file placeholder for a custom domain setup guide component.",
  "frontend/src/components/Footer.tsx": "Renders a market ticker footer showing NIFTY 100 data with live/closed status and stock prices.",
  "frontend/src/components/GlossaryBackupRestorePanel.tsx": "Provides UI for exporting, validating, and restoring glossary snapshots via merge or replace modes.",
  "frontend/src/components/GlossaryBulkImportCTermsPanel.tsx": "Allows publishing a predefined batch of C‑terms to the glossary with confirmation and status alerts.",
  "frontend/src/components/Header.tsx": "Creates the main site header with navigation, theming, auth handling, calculators menu, and mobile sheet.",
  "frontend/src/components/MaintenanceScreen.tsx": "Shows a simple maintenance page with branding and explanatory text.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Displays a centered spinner and 'Loading...' text as a route-level loading fallback.",
  "frontend/src/data/glossaryBulkImportC.ts": "Provides a batch of static glossary entries for C-terms used for backend bulk import.",
  "frontend/src/hooks/useActor.ts": "Builds and caches a backend actor tied to Internet Identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook that manages client auth, identity state, and login flow.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for maintenance mode, admin checks, user profiles, chat, and glossary operations using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS theme tokens for light and dark modes using OKLCH values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and philosophy sections using styled cards.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays categorized financial articles with tab navigation and fetches data per category.",
  "frontend/src/pages/AtalPensionYojanaCalculatorPage.tsx": "Implements an APY calculator that computes pension contributions based on age and desired pension.",
  "frontend/src/pages/BlogDetailPage.tsx": "Shows a full blog post with metadata, tags, and error/loading states.",
  "frontend/src/pages/BlogsPage.tsx": "Lists all blogs with previews and navigation to detailed blog pages.",
  "frontend/src/pages/CAGRCalculatorPage.tsx": "Interactive CAGR calculator page with input fields for initial value, final value, and years, computing and displaying the annual growth rate.",
  "frontend/src/pages/CalculatorsPage.tsx": "Lists categorized financial calculators with icons and navigation links for investment, retirement, and savings tools.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page allowing users to submit feedback via an API and view email and Instagram contact options.",
  "frontend/src/pages/DisclaimerPage.tsx": "Displays legal disclaimers, investment risk warnings, and clarifies the site provides educational content only.",
  "frontend/src/pages/DomainNamePage.tsx": "Empty placeholder page with no implemented content.",
  "frontend/src/pages/EMICalculatorPage.tsx": "Loan EMI calculator page that computes monthly payments, total interest, and total repayment based on user inputs.",
  "frontend/src/pages/EPFCalculatorPage.tsx": "EPF calculator page that computes employee/employer contributions, interest accrual, and maturity balance based on salary and tenure inputs.",
  "frontend/src/pages/FDCalculatorPage.tsx": "Fixed Deposit calculator supporting simple and compound interest to compute maturity amount and interest earned.",
  "frontend/src/pages/FeedbackAdminPage.tsx": "Admin interface for viewing, filtering, and sorting user feedback with authentication and access control.",
  "frontend/src/pages/FixedVsReducingLoanCalculatorPage.tsx": "Compares fixed-rate and reducing-balance loan interest, calculating total repayment and differences.",
  "frontend/src/pages/GlossaryPage.tsx": "Renders a searchable glossary with grouped terms, admin diagnostics, and backup/import panels.",
  "frontend/src/pages/GratuityCalculatorPage.tsx": "Provides a gratuity calculator based on salary and years of service with eligibility logic and formatted output.",
  "frontend/src/pages/GSTCalculatorPage.tsx": "GST calculator that computes CGST, SGST, total tax, and final amount for a given base amount and GST rate.",
  "frontend/src/pages/HomeLoanEMICalculatorPage.tsx": "Computes home loan EMI, total interest, and repayment from loan amount, rate, and tenure.",
  "frontend/src/pages/HomePage.tsx": "Displays the main landing page with hero content, navigation buttons, and feature overview sections.",
  "frontend/src/pages/HRACalculatorPage.tsx": "Calculates HRA exemption and taxable components using salary, rent, DA, and city type inputs.",
  "frontend/src/pages/LearningPage.tsx": "Renders the learning sections page with topic selection, auto-scroll, and matched topic indicators using fetched sections.",
  "frontend/src/pages/LumpSumCalculatorPage.tsx": "Provides a lump sum investment calculator with compound interest, input fields, results, and cash flow breakdown.",
  "frontend/src/pages/NPSCalculatorPage.tsx": "Implements an NPS calculator computing total corpus, annuity amount, and monthly pension based on user inputs.",
  "frontend/src/pages/NSCCalculatorPage.tsx": "Calculates NSC maturity and interest using compound interest with user-provided principal, rate, and tenure.",
  "frontend/src/pages/PPFCalculatorPage.tsx": "Calculates PPF total investment, interest, and maturity value using yearly contributions and compounding logic.",
  "frontend/src/pages/RDCalculatorPage.tsx": "Provides a recurring deposit calculator with inputs for monthly investment, interest rate, and tenure, computing deposit totals and maturity value.",
  "frontend/src/pages/RegulationsPage.tsx": "Displays SEBI and RBI regulatory information, investor protection guidelines, and fraud awareness content using tabs and alerts.",
  "frontend/src/pages/ResearchPapersPage.tsx": "Fetches and lists research papers with download support, showing loading and empty states.",
  "frontend/src/pages/SimpleInterestCalculatorPage.tsx": "React page providing a simple interest calculator with inputs for principal, rate, and time and displaying computed interest and total amount.",
  "frontend/src/pages/SimpleVsCompoundInterestCalculatorPage.tsx": "React page comparing simple and compound interest using principal, rate, time, and compounding frequency, showing results and differences.",
  "frontend/src/pages/SIPCalculatorPage.tsx": "Implements a SIP return calculator with monthly inputs, compound growth computation, and a generated cash flow schedule.",
  "frontend/src/pages/SSYCalculatorPage.tsx": "Calculates Sukanya Samriddhi Yojana maturity values based on yearly investment, daughter's age, and fixed interest rate.",
  "frontend/src/pages/StepUpCalculatorPage.tsx": "React page offering step-up SIP calculations by fixed amount or percentage, computing future value, invested amount, and returns.",
  "frontend/src/pages/SWPCalculatorPage.tsx": "Provides a Systematic Withdrawal Plan calculator that simulates monthly withdrawals, growth, and remaining balance over time.",
  "frontend/src/pages/XIRRCalculatorPage.tsx": "React page allowing users to add dated cash flows and calculates XIRR using a Newton–Raphson approximation.",
  "frontend/src/utils/arthSaathiChat.ts": "Utility functions for detecting language, intent, and generating refusal messages for a finance education chat assistant.",
  "frontend/src/utils/assetPaths.ts": "Centralized utility building asset URLs using Vite base paths and exporting branded asset references.",
  "frontend/src/utils/cashFlowSchedules.ts": "Utility functions for generating cash flow schedules, labels, and running balances for calculators.",
  "frontend/src/utils/csv.ts": "Provides CSV field escaping, array-to-CSV conversion, and a browser download helper.",
  "frontend/src/utils/feedbackForm.ts": "Defines Google Form URL utilities for opening the feedback form and generating an embed URL.",
  "frontend/src/utils/formatters.ts": "Contains number, currency, percentage, and byte-size formatting helpers using Indian conventions.",
  "frontend/src/utils/glossaryFormatting.ts": "Parses glossary definitions, normalizes terms, determines grouping keys, and resolves term references.",
  "frontend/src/utils/glossaryKey.ts": "Generates deterministic normalized keys for glossary terms and converts terms to backend-compatible keys.",
  "frontend/src/utils/learningTopics.ts": "Defines learning topic slugs and labels with helpers to lookup or match sections to topics.",
  "frontend/src/utils/navStructure.ts": "Defines the grouped site navigation structure used across desktop and mobile views.",
  "frontend/src/utils/urlParams.ts": "Provides URL parameter parsing, session persistence, and hash cleanup utilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and container settings.",
  "project_state.json": "Describes project metadata, existing features, and pending feature requests for the NIFTY Top 100 ticker."
}