{
  "kind": "build_request",
  "title": "Embed Google Form inside Contact > Feedback card",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Contact page so that the existing \"Feedback\" card embeds the provided Google Form directly inside the card (iframe embed), instead of only offering a button/link to open it in a new tab.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "ha Embed kar do",
          "No Contact ke under Feedback me",
          "Card Style"
        ]
      },
      "acceptanceCriteria": [
        "On the Contact page, the \"Feedback\" card renders an embedded Google Form (iframe) within the card content area.",
        "The current \"Open Feedback Form\" button is removed (no dedicated feedback button interaction is required).",
        "The embedded form uses the provided Google Form URL: https://docs.google.com/forms/d/e/1FAIpQLScqZU_oBmXqsYR-sS69AifMXRb10D6kLxFhBOXzELqk0aOb5w/viewform?usp=publish-editor (adapted to Google’s supported embed format if needed, while preserving the same form).",
        "The embed is presented in a card-style layout consistent with existing Card UI (responsive sizing; no horizontal overflow on mobile)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Centralize the embedded-form URL derivation in the existing feedback form utility so the Contact page embed stays consistent with the already-shared Google Form constant.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-4"
        ],
        "quotes": [
          "deployed link jo mene share kiya ye wala Google form ka - https://docs.google.com/forms/d/e/1FAIpQLScqZU_oBmXqsYR-sS69AifMXRb10D6kLxFhBOXzELqk0aOb5w/viewform?usp=publish-editor",
          "Ha Embed kar do"
        ]
      },
      "acceptanceCriteria": [
        "The Contact page iframe src is built from the shared constant in frontend/src/utils/feedbackForm.ts (no hardcoded duplicate URL in ContactPage).",
        "Existing behavior elsewhere that opens the form in a new tab via the shared constant remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not create a separate /feedback page and do not add a dedicated Feedback button outside the Contact > Feedback card.",
    "Do not modify files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Changing backend storage or adding backend APIs for feedback embedding.",
    "Replacing Internet Identity or changing authentication flows.",
    "Adding a new navigation item or route solely for feedback."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}