{
  "kind": "build_request",
  "title": "Replace calculator result bar chart with pie chart breakdown",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new reusable calculator visualization component that renders the invested vs earned breakdown as a pie/donut chart, matching the existing light/dark theme tokens and visual style used by the current breakdown card. The component must support the same inputs as the existing bar chart: invested, earned, optional total, and optional label overrides; it must also handle empty/zero values by showing the existing empty-state message in a card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "replace with pie chart in calculators"
        ]
      },
      "acceptanceCriteria": [
        "A new pie/donut breakdown component exists under frontend/src/components/calculators (new file) and can be imported by calculator pages.",
        "Given invested > 0 or earned > 0, the chart renders slices for invested and earned with correct proportions based on invested + earned.",
        "Given invested=0 and earned=0 (and total absent or 0), the component renders the same kind of card-based empty state prompting the user to enter valid inputs.",
        "The component uses existing theme color tokens (e.g., chart variables) and remains legible in both light and dark mode.",
        "The component includes a legend that shows the label + exact INR-formatted value for each slice (and uses the same label override behavior as the current bar chart component)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace usage of the existing ResultBreakdownBarChart with the new pie/donut chart component in all calculator pages that currently render the bar chart breakdown (at minimum: SIP, Lump Sum, and PPF), keeping the placement directly below the numeric results summary and preserving the existing labels and displayed values.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "replace with pie chart in calculators"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/pages/SIPCalculatorPage.tsx no longer renders ResultBreakdownBarChart and instead renders the pie/donut breakdown with the same invested/earned/total inputs and labels.",
        "frontend/src/pages/LumpSumCalculatorPage.tsx no longer renders ResultBreakdownBarChart and instead renders the pie/donut breakdown with the same invested/earned/total inputs and labels.",
        "frontend/src/pages/PPFCalculatorPage.tsx no longer renders ResultBreakdownBarChart and instead renders the pie/donut breakdown with the same invested/earned/total inputs and labels.",
        "All updated calculator pages compile without unused-import warnings and render the breakdown correctly."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn components are read-only and must only be composed).",
    "Keep the existing single-page routing and calculator page layouts intact; only replace the breakdown visualization."
  ],
  "nonGoals": [
    "Do not change calculator formulas or numeric result outputs.",
    "Do not add backend APIs or persist calculator inputs/results.",
    "Do not add a new charting library dependency unless strictly necessary."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}