{
  "kind": "build_request",
  "title": "Fetch and display live share prices from NSE India in the Market Ticker",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support to fetch share prices from the NSE India website (https://www.nseindia.com/) using HTTP outcalls, and expose a query method that returns the latest available stock price data (at minimum: symbol, companyName, ltp, dayClose) for the frontend market ticker.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "market Ticker Shares price take it from NSE Web site - https://www.nseindia.com/"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method that returns an array of Stock records (symbol, companyName, ltp, dayClose) sourced from https://www.nseindia.com/.",
        "The HTTP outcall logic handles upstream failures gracefully (does not trap for transient HTTP errors; returns a clear error or an empty list consistently).",
        "Responses are reasonably cached/throttled inside the canister to avoid excessive outcalls while still allowing fresh data when the market is open.",
        "No additional backend actors/services are introduced; all logic remains in backend/main.mo."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend market ticker uses backend-provided NSE-sourced stock data and has appropriate loading, empty, and error states in the ticker UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "market Ticker Shares price take it from NSE Web site - https://www.nseindia.com/"
        ]
      },
      "acceptanceCriteria": [
        "The footer market ticker renders a loading state while fetching, renders stock cards when data is available, and renders a clear empty state when no data is available.",
        "If fetching fails, the UI shows a non-crashing error/empty experience (e.g., a message indicating data is unavailable) and does not break the rest of the page.",
        "The data shown in the ticker matches the backend fields: company name, symbol, and the displayed price (LTP during market hours; closing price when market is closed)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not modify any files under frontend/src/components/ui or other frontend immutablePaths."
  ],
  "nonGoals": [
    "Adding third-party auth (other than Internet Identity).",
    "Implementing trading, order placement, portfolios, or watchlists.",
    "Using any external database or non-IC backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}