{
  "kind": "build_request",
  "title": "Bulk add provided finance terms to Glossary (C-terms list)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an admin-only bulk action to publish the user-provided glossary entries (starting from “CEDEL” through “Custody risk”) into the on-chain glossary using the existing backend batch API, so the terms become visible and searchable in the Glossary page.",
      "target": "both",
      "source": {
        "messageIds": [
          "user-last"
        ],
        "quotes": [
          "Add these in Glossary - CEDEL ... Custody risk"
        ]
      },
      "acceptanceCriteria": [
        "When an admin triggers the bulk publish action, all provided terms are added/updated in the backend glossary map via a single batch call (or an equivalent minimal number of calls).",
        "After publishing, the Glossary page search returns these new terms (e.g., searching “CEDEL”, “CAPM”, “Cash Settlement”, “Custodian”).",
        "Each published entry uses the exact term text and definition text as provided by the user; example and usage fields are stored as empty strings unless explicitly provided.",
        "Keys used for insertion are deterministic and consistent (e.g., normalized to trimmed lowercase of the term) so repeated publishes update the same entries rather than creating duplicates.",
        "If the caller is not an admin, the bulk publish UI is not shown and the backend still enforces admin-only access (traps on unauthorized)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a small admin UI in the Glossary area that explains what will be imported and provides a confirmation step before publishing the bulk glossary entries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-last"
        ],
        "quotes": [
          "Add these in Glossary - CEDEL ..."
        ]
      },
      "acceptanceCriteria": [
        "The bulk import UI is only rendered when `useIsCallerAdmin()` is true.",
        "The UI includes an explicit confirmation (e.g., dialog) before performing the publish action.",
        "On success, show an English success message and refresh glossary queries so the new terms display immediately without a manual reload.",
        "On error, show an English error message with the error string if available."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text in the build request and resulting UI.",
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add third-party CMS/DB integrations or external storage for glossary.",
    "Do not change the glossary data model fields (term/definition/example/usage) beyond populating the provided terms.",
    "Do not redesign the entire Glossary page UI beyond adding the minimal admin import controls."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}