{
  "kind": "build_request",
  "title": "Add NIFTY Top 100 live market ticker sourced from NSE India",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add backend support to fetch and serve NIFTY Top 100 (NIFTY 100) stock prices sourced from https://www.nseindia.com/ via canister HTTP outcalls, returning an array of Stock items (symbol, companyName, ltp, dayClose).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add market ticker nifty top 100 stock source from https://www.nseindia.com/ AND show in website live price"
        ]
      },
      "acceptanceCriteria": [
        "A new backend method is available to the frontend that returns NIFTY Top 100 stocks as [Stock] with fields symbol, companyName, ltp, and dayClose.",
        "The backend market-data fetch uses HTTPS requests to https://www.nseindia.com/ (no browser-side calls to NSE).",
        "Backend responses are resilient: on upstream fetch failure, the method returns the most recent cached data if available; otherwise it returns an empty array (and does not trap).",
        "Market data is cached server-side to avoid fetching on every request, with a documented cache TTL appropriate for \"live\" display (e.g., tens of seconds while market is open)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose a new React Query hook to retrieve NIFTY Top 100 stock data from the backend and refetch it periodically to provide live prices.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add market ticker nifty top 100 stock source from https://www.nseindia.com/ AND show in website live price"
        ]
      },
      "acceptanceCriteria": [
        "A new hook exists in frontend/src/hooks/useQueries.ts (e.g., useGetNifty100Stocks) that calls the new backend method.",
        "The query refetches periodically to keep prices live (similar to the existing useGetNifty50Stocks behavior).",
        "When the backend actor is not available, the hook returns an empty array without throwing."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the website market ticker UI to display NIFTY Top 100 live prices (instead of NIFTY 50), including appropriate label text for live vs closed market state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add market ticker nifty top 100 stock source from https://www.nseindia.com/ AND show in website live price"
        ]
      },
      "acceptanceCriteria": [
        "The ticker label text reflects NIFTY Top 100 (e.g., \"Live Market Ticker: NIFTY 100 LTP\" when open and \"Market Ticker: NIFTY 100 Closing Prices\" when closed).",
        "The ticker renders up to 100 stock tiles with symbol, formatted price, and company name.",
        "When data is loading, an in-place loading indicator is shown; when data fails, an in-place error state is shown (keeping the current UX pattern in Footer.tsx)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo); only add migration.mo if an upgrade requires state migration.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui.",
    "All user-facing text must be in English.",
    "Market data must be sourced from https://www.nseindia.com/ (per user request)."
  ],
  "nonGoals": [
    "Adding user accounts, watchlists, portfolios, alerts, or trading features.",
    "Building charts, historical OHLC data, or intraday analytics beyond showing live/closing prices in the ticker.",
    "Integrating third-party auth providers, WebSockets, or external databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}