{
  "kind": "build_request",
  "title": "Fix Draft Glossary showing empty and prevent misleading empty-state when backend actor is unavailable",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Persist glossary terms in the Motoko backend across canister upgrades so glossary data does not reset to empty after draft deployments.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "draft wale me Glossary me kuch bhi show nhi ho raha"
        ]
      },
      "acceptanceCriteria": [
        "After deploying/upgrading the canister, previously added glossary terms are still returned by getGlossaryTerms().",
        "A canister upgrade that previously caused an empty glossary no longer clears glossary terms.",
        "Glossary backup/restore and batch publish endpoints continue to function and reflect the persisted glossary state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Glossary page empty-state logic so it only shows “Glossary is Empty” after glossary queries have actually fetched from the backend; if the backend actor is not yet available (e.g., draft config/connection issue), show a non-empty error/loading state instead of an empty glossary message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "draft wale me Glossary me kuch bhi show nhi ho raha"
        ]
      },
      "acceptanceCriteria": [
        "When the backend actor is unavailable (or glossary queries are not enabled yet), the UI does not show “Glossary is Empty”.",
        "Once the glossary query successfully fetches and returns 0 terms (and search box is empty), the UI shows the existing “Glossary is Empty” message.",
        "When the glossary query fails (network/canister error), the UI shows the existing error alert, not the empty-state alert."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add lightweight diagnostics (developer-facing console logging is sufficient) in the Glossary data-fetch path to help differentiate between: (a) actor not initialized, (b) query disabled due to actor state, (c) successful fetch returning 0 terms, and (d) fetch error—so draft environment issues can be identified quickly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "draft wale me Glossary me kuch bhi show nhi ho raha"
        ]
      },
      "acceptanceCriteria": [
        "When running the app, the browser console clearly indicates which of the four states occurred when opening the Glossary page.",
        "No user-facing text is changed to Hindi; any user-facing additions remain in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useActor.ts and frontend/src/hooks/useInternetIdentity.ts).",
    "Keep all backend logic in the single Motoko actor at backend/main.mo; only introduce migration logic if strictly required for preserving existing stable state."
  ],
  "nonGoals": [
    "Do not change the glossary grouping/sorting behavior (A/B/C sections) unless required to fix the empty glossary issue.",
    "Do not introduce any external database or third-party backend services.",
    "Do not add new authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}