{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Embed Google Form in Contact Feedback card",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Embed the provided Google Form inside the existing Contact > Feedback card and remove the open-in-new-tab button.",
      "acceptanceCriteria": [
        "On the Contact page, the \"Feedback\" card renders an embedded Google Form (iframe) within the card content area.",
        "The current \"Open Feedback Form\" button is removed (no dedicated feedback button interaction is required).",
        "The embedded form uses the provided Google Form URL: https://docs.google.com/forms/d/e/1FAIpQLScqZU_oBmXqsYR-sS69AifMXRb10D6kLxFhBOXzELqk0aOb5w/viewform?usp=publish-editor (adapted to Google’s supported embed format if needed, while preserving the same form).",
        "The embed is presented in a card-style layout consistent with existing Card UI (responsive sizing; no horizontal overflow on mobile)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Update the existing \"Feedback\" CardContent to render an iframe embed of the Google Form within the card; remove the current Button that calls openFeedbackForm and remove any now-unused imports (e.g., ExternalLink, Button, openFeedbackForm) while keeping all user-facing text in English. Ensure responsive sizing (full-width iframe container, fixed/min height, overflow-hidden to prevent horizontal scrolling on mobile)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Centralize Google Form embed URL derivation in the shared feedback form utility and consume it from ContactPage.",
      "acceptanceCriteria": [
        "The Contact page iframe src is built from the shared constant in frontend/src/utils/feedbackForm.ts (no hardcoded duplicate URL in ContactPage).",
        "Existing behavior elsewhere that opens the form in a new tab via the shared constant remains unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/feedbackForm.ts",
          "operation": "modify",
          "description": "Add a small utility (e.g., getFeedbackFormEmbedUrl()) that derives the Google-supported iframe embed URL from GOOGLE_FEEDBACK_FORM_URL (preserving the same form), without changing openFeedbackForm behavior."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Import and use the new embed-URL utility from frontend/src/utils/feedbackForm.ts to set the iframe src, ensuring no duplicate hardcoded Google Form URL exists in this page."
        }
      ]
    }
  ]
}