{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Use backend-provided NSE stock data in footer Market Ticker with loading/empty/error states",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update the footer market ticker to fetch NSE-sourced stock data from the backend and render robust loading, empty, and error states while displaying LTP vs closing price appropriately.",
      "acceptanceCriteria": [
        "The footer market ticker renders a loading state while fetching, renders stock cards when data is available, and renders a clear empty state when no data is available.",
        "If fetching fails, the UI shows a non-crashing error/empty experience (e.g., a message indicating data is unavailable) and does not break the rest of the page.",
        "The data shown in the ticker matches the backend fields: company name, symbol, and the displayed price (LTP during market hours; closing price when market is closed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/adjust React Query hooks for the Market Ticker to rely on backend capabilities: (1) ensure the existing stock query uses the backend actor to fetch Stock[] (symbol, companyName, ltp, dayClose) and exposes error state without throwing UI-breaking errors; (2) introduce a dedicated query hook for backend market-open status (e.g., via the backend market-status capability) so the ticker can choose LTP vs dayClose based on backend truth rather than client time. Use core-infrastructure actor wiring via useActor. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update the Market Ticker section to use backend-provided market status and stock data, and add explicit error and empty UI states: show a clear message when data cannot be loaded, keep the rest of the footer/page stable, and keep the existing loading spinner. Replace or de-emphasize the current client-side market-hours detection in favor of backend market-open status for deciding whether to display LTP or dayClose. Continue using the existing shadcn-ui ScrollArea/ScrollBar for horizontal scrolling. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}