{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Glossary: prevent misleading empty state when actor unavailable + add fetch-path diagnostics",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Show “Glossary is Empty” only after a successful glossary fetch; when actor/query is unavailable, show a non-empty loading/error state instead.",
      "acceptanceCriteria": [
        "When the backend actor is unavailable (or glossary queries are not enabled yet), the UI does not show “Glossary is Empty”.",
        "Once the glossary query successfully fetches and returns 0 terms (and search box is empty), the UI shows the existing “Glossary is Empty” message.",
        "When the glossary query fails (network/canister error), the UI shows the existing error alert, not the empty-state alert."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust glossary query hooks (useSearchTerms, useGetAllTerms) to expose actor/query readiness and a reliable “fetched” signal (e.g., isQueryEnabled, isActorAvailable, isFetched) so the Glossary page can distinguish disabled/unavailable vs successfully fetched empty results."
        },
        {
          "path": "frontend/src/pages/GlossaryPage.tsx",
          "operation": "modify",
          "description": "Update empty-state gating to require a successful fetch before showing “Glossary is Empty” and before showing “No terms found”. When glossary queries are disabled because the actor is unavailable/not ready, render a non-empty loading/connection alert state instead of empty glossary messaging."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add developer-facing console diagnostics for Glossary actor/query readiness, fetch results, and fetch errors.",
      "acceptanceCriteria": [
        "When running the app, the browser console clearly indicates which of the four states occurred when opening the Glossary page.",
        "No user-facing text is changed to Hindi; any user-facing additions remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add lightweight console logging in the glossary fetch path to differentiate: (a) actor not initialized, (b) query disabled due to actor fetching/state, (c) successful fetch returning 0 terms, and (d) fetch error. Keep logs developer-facing only (console.*), without changing user-facing copy."
        }
      ]
    }
  ]
}