{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "NIFTY 100 live market ticker (frontend wiring)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a React Query hook to fetch NIFTY 100 stocks from the backend and refetch periodically for live prices.",
      "acceptanceCriteria": [
        "A new hook exists in frontend/src/hooks/useQueries.ts (e.g., useGetNifty100Stocks) that calls the new backend method.",
        "The query refetches periodically to keep prices live (similar to the existing useGetNifty50Stocks behavior).",
        "When the backend actor is not available, the hook returns an empty array without throwing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook (e.g., useGetNifty100Stocks) that calls actor.getNifty100Stocks(), uses periodic refetching for live updates (mirroring the timing pattern of useGetNifty50Stocks), and safely returns an empty array when the actor is unavailable (no throw)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update the footer market ticker UI to show NIFTY 100 live/closing prices with correct labels and states.",
      "acceptanceCriteria": [
        "The ticker label text reflects NIFTY Top 100 (e.g., \"Live Market Ticker: NIFTY 100 LTP\" when open and \"Market Ticker: NIFTY 100 Closing Prices\" when closed).",
        "The ticker renders up to 100 stock tiles with symbol, formatted price, and company name.",
        "When data is loading, an in-place loading indicator is shown; when data fails, an in-place error state is shown (keeping the current UX pattern in Footer.tsx)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Switch the ticker data source from useGetNifty50Stocks to the new useGetNifty100Stocks hook; update label text to NIFTY 100 variants for open/closed states; ensure rendering is capped to at most 100 tiles; preserve the existing in-place loading spinner and error/empty states pattern already used in this component."
        }
      ]
    }
  ]
}