{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin bulk publish C-terms glossary batch into on-chain glossary",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an admin-only bulk publish action in the Glossary UI that calls the existing backend batch publish capability so C-terms (CEDEL through Custody risk) become visible and searchable.",
      "acceptanceCriteria": [
        "When an admin triggers the bulk publish action, all provided terms are added/updated in the backend glossary map via a single batch call (or an equivalent minimal number of calls).",
        "After publishing, the Glossary page search returns these new terms (e.g., searching “CEDEL”, “CAPM”, “Cash Settlement”, “Custodian”).",
        "Each published entry uses the exact term text and definition text as provided by the user; example and usage fields are stored as empty strings unless explicitly provided.",
        "Keys used for insertion are deterministic and consistent (e.g., normalized to trimmed lowercase of the term) so repeated publishes update the same entries rather than creating duplicates.",
        "If the caller is not an admin, the bulk publish UI is not shown and the backend still enforces admin-only access (traps on unauthorized)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/glossaryBulkImportC.ts",
          "operation": "create",
          "description": "Add a static, version-controlled list of the user-provided glossary entries (CEDEL through Custody risk) with exact term/definition text; keep example/usage as empty strings unless explicitly provided. This module will be used to construct the batch payload for the backend publishGlossaryBatch call."
        },
        {
          "path": "frontend/src/utils/glossaryKey.ts",
          "operation": "create",
          "description": "Implement deterministic glossary key normalization (e.g., trimmed lowercase, consistent whitespace handling) used by the bulk import to prevent duplicates across repeated publishes."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook (e.g., usePublishGlossaryBatch) that calls the backend publishGlossaryBatch capability with the constructed batch terms, and on success invalidates all glossary-related queries (including search) so newly published terms are immediately visible. Verify the component's usage instructions before implementing (authorization: useActor/useIsCallerAdmin patterns; shadcn-ui: toast via sonner is already used here)."
        },
        {
          "path": "frontend/src/components/GlossaryBulkImportCTermsPanel.tsx",
          "operation": "create",
          "description": "Create an admin-only panel component that builds the batch payload from glossaryBulkImportC.ts (using glossaryKey normalization) and triggers the publish mutation. The UI should not render any controls for non-admin users. Verify the component's usage instructions before implementing (shadcn-ui components like Card/Button/AlertDialog)."
        },
        {
          "path": "frontend/src/pages/GlossaryPage.tsx",
          "operation": "modify",
          "description": "Wire the new GlossaryBulkImportCTermsPanel into the existing Glossary page within the admin-only section (near the existing GlossaryBackupRestorePanel) so admins can publish the batch and see results reflected immediately. Verify the component's usage instructions before implementing (authorization via useIsCallerAdmin; shadcn-ui layout components already used on this page)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement a minimal admin UI in the Glossary area that explains the import scope and requires explicit confirmation before publishing the bulk C-terms batch, with clear success/error messages.",
      "acceptanceCriteria": [
        "The bulk import UI is only rendered when `useIsCallerAdmin()` is true.",
        "The UI includes an explicit confirmation (e.g., dialog) before performing the publish action.",
        "On success, show an English success message and refresh glossary queries so the new terms display immediately without a manual reload.",
        "On error, show an English error message with the error string if available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GlossaryBulkImportCTermsPanel.tsx",
          "operation": "modify",
          "description": "Add explanatory copy (English) describing what will be imported (term range and count), include a confirmation step using an AlertDialog before publishing, and show English success/error messaging (e.g., via sonner toast or inline Alert) including the error string when available. Verify the component's usage instructions before implementing (shadcn-ui AlertDialog/Alert/Button)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the publish mutation surfaces errors in a way the UI can display (preserve error.message), and that success handling triggers glossary query invalidation/refetch so results appear immediately without reload. Verify the component's usage instructions before implementing (authorization patterns and sonner toast usage)."
        },
        {
          "path": "frontend/src/pages/GlossaryPage.tsx",
          "operation": "modify",
          "description": "Confirm the bulk import admin UI is conditionally rendered only when useIsCallerAdmin() is true and remains minimal (no broader Glossary redesign). Verify the component's usage instructions before implementing (authorization hook usage; existing shadcn-ui layout)."
        }
      ]
    }
  ]
}